// ignore_for_file: non_constant_identifier_names

class Schemes {
  // ignore: prefer_typing_uninitialized_variables

  final Schemes_Name, Schemes_Description, link;

  Schemes({
    this.Schemes_Description,
    this.Schemes_Name,
    this.link,
  });
}

final List<Schemes> dataList1 = List.generate(
  Schemes_Name.length,
  (index) => Schemes(
      Schemes_Name: Schemes_Name[index],
      Schemes_Description: Schemes_Description[index],
      link: link[index]),
);

List<String> Schemes_Name = [
  'आवास योजना लिस्ट ग्रामीण',
  'ग्रामीण आवास लाभार्थी सूचि',
  'आवास योजना लिस्ट शहरी',
  'आधार कार्ड से देखे - शहरी',
  'भूलेख खसरा खतौनी',
  'राशन कार्ड',
  'शौचालय योजना लिस्ट',
  'उज्ज्वला योजना लिस्ट',
  'BPL लिस्ट (सभी राज्य)',
  'ग्राम पंचायत रिपोर्ट',
  'नरेगा जॉब कार्ड',
  'पेंशन सूचि देखे',
  'पेंशन सूचि (नाम से देखें)',
];

List<String> Schemes_Description = [
  'आज हम आपको प्रधानमंत्री ग्रामीण आवास योजना लिस्ट के बारे में विस्तारपूर्वक जानकारी प्रदान करेंगे हम आपको बतायेगे की आप किस प्रकार प्रधानमंत्री ग्रामीण आवास योजना लिस्ट को ऑनलाइन देख सकते है| Pradhan Mantri Gramin Awas Yojana के अंतर्गत जिन आवेदकों ने रजिस्ट्रेशन तथा ऑनलाइन आवेदन किये थे और वह ग्रामीण आवास योजना लिस्ट का इंतज़ार कर रहे थे उन आवेदकों के लिए PMAY-Gramin की आधिकारिक वेबसाइट@pmayg.gov.in पर सूची जारी की जा रही है। प्रधानमंत्री आवास योजना भारत में सरकार द्वारा शुरू की गई स्कीम है, जिसका उद्देश्य कमजोर आय वर्ग के लोगों को शहरी और ग्रामीण इलाकों में सस्ते घर उपलब्ध करवाना है. 25 जून, 2015 को शुरू की गई थी और 31 मार्च, 2022 तक इसके तहत 2 करोड़ घर बनाने का लक्ष्य रखा गया है. इस प्रमुख योजना के अंतर्गत पहली बार घर खरीदने वालों को CLSS या क्रेडिट लिंक्ड सब्सिडी दी जाती है. यानी घर खरीदने के लिए होम लोन पर ब्याज सब्सिडी प्रदान की जाती है. यह सब्सिडी अधिकतम 2.67 लाख रुपये तक हो सकती है. यह केंद्र सरकार द्वारा स्पांसर्ड स्कीम है. स्कीम के तहत 4 कटेगिरी 3 लाख से 6 लाख सालाना आय वाले इकोनॉमिकली वीकर सेक्शन (EWS) और लोअर इनकम ग्रुप (LIG), 6 लाख से 12 लाख सालाना आय वाले मिडिल इनकम ग्रुप 1 (MIG1) और12 लाख से 18 लाख सालाना आय वाले मिडिल इनकम ग्रुप 2 इकोनॉमिकली वीकर सेक्शन (EWS), लोअर इनकम ग्रुप (LIG) को क्रेडिट लिंक्ड सब्सिडी का फायदा 31 मार्च 2022 तक मिलता रहेगा. लेकिन मिडिल इनकम ग्रुप 1 (MIG1) और मिडिल इनकम ग्रुप 2 (MIG2) को यह फायदा 31 मार्च तक आवेदन करने पर ही मिला है. हालांकि इन दोनों ग्रुप के लिए भी सब्सिडी का लाभ 31 मार्च 2022 तक बढ़ाए जाने की मांग की जा रही है.',
  'इस योजना की नई सूची के अंतर्गत लाभार्थियों के नाम जारी किये जायेगे | PMAY-G New List के अंतर्गत उन लाभार्थियों का नाम आएगा जिन्हे इस योजना के लिए चुना गया है | प्रधानमंत्री ग्रामीण आवास योजना लिस्ट और PMAY-G नई संशोधित सूची में जिन लाभार्थियों का नाम होगा वही इस योजना का लाभ सकते है और पक्का घर बनाने के लिए धनराशि प्राप्त कर सकते है इस योजना की ऑनलाइन लिस्ट में आपको लाभार्थी के मूल विवरण तथा बैंक खाता विवरण मिलेगा | प्रधानमंत्री ग्रामीण आवास योजना लिस्ट की खोज लाभार्थी 2 तरीके से कर सकते है।',
  'प्रधानमंत्री आवास योजना लिस्ट के अंतर्गत उन लाभार्थियों को शामिल किया गया है जिन्होंने हाल ही में गत वर्ष प्रधानमंत्री आवास योजना के अंतर्गत ऑनलाइन आवेदन किया था। केंद्र सरकार द्वारा लाभार्थियों के सभी दस्तावेजों का सत्यापन कर प्रधानमंत्री आवास योजना लिस्ट में उनका नाम सम्मिलित किया गया है। देश का कोई भी निवासी जिसने PMAY Yojana के अंतर्गत आवेदन किया है वह आसानी से पीएमएवाई सूची में अपना नाम खोज सकता है। प्यारे दोस्तों आज हम आपको Pradhan Mantri Awas Yojana List के अंतर्गत अपना नाम खोजने का बहुत ही सरल व आसान तरीका बताने जा रहे हैं।',
  'अब आधार कार्ड प्रधानमंत्री आवास योजना के लिए भी जरूरी हो गया है। बिना आधार कार्ड के आप प्रधानमंत्री आवास योजना के लिए आवेदन नहीं दे पाएंगे। अगर आपके पास अभी आधार कार्ड नहीं है तो आप नजदीकी आधार सेंटर में जाकर आधार कार्ड के लिए आप्लाई कर दें। आपको बता दें कि प्रधानमंत्री आवास योजना केंद्र सरकार की महत्वाकांक्षी योजनाओ में से एक है। केंद्र सरकार का लक्ष्य है कि वह 2022 तक सबके पास अपना घर हो। अगर आपके पास अपना खुद का घर नहीं है और आप अपना घर लेने की योजना बना रहे हैं तो प्रधानमंत्री आवास योजना आपके लिए एक बेहतर विकल्प है। पहले जहां इस योजना का लाभ गरीब वर्ग के लिए था वहीं अब इस योजना में लोन की रकम बढ़ाकर शहरी गरीब और',
  'भुलेख खसरा खतौनी भूलेख वेब पोर्टल का निर्माण उत्तर प्रदेश के भूमि रिकार्ड को कंप्यूटरीकृत करने के लिए इस प्रकार किया गया है कि भू-अभिलेखों के प्रतिदिन की गतिविधियों को सुव्यवस्थित किया जा सके| भूलेख पोर्टल खतौनी के पूरे जीवन चक्र को बनाए रखता है',
  'यह खाद्य एवं रसद विभाग उत्तर प्रदेश के पोर्टल का परीक्षण संस्करण है। Screen Reader Access isht रीडर; Sitemap साईट मैप, Feedback फीडबैक ; Skip to main content मुख्य सामग्री पर जाएं. Food and Civil Supplies Department logo. CEI एवं रसद विभाग, उत्तर प्रदेश सरकार',
  'आप इस शौचालय लिस्ट को ऑनलाइन डाउनलोड भी कर सकते है । यहाँ नीचे हम आपको Sauchalay List ग्रामीण सूची के बारे में विस्तार से जानकारी दे रहे हैं। प्रधानमंत्री ग्रामीण आवास योजना. प्रधानमंत्री स्वच्छ भारत',
  'उज्ज्वला योजना के लाभार्थियों की पहचान करने के लिए सरकार उज्ज्वला योजना लाभार्थी सूची तैयार करती है। नए जुड़े लोगों के नाम इस सूची में समय समय पर जोड़े जाते हैं । इस लेख में बात करेंगे के कैसे आप लाभार्थी सूची ऑनलाइन ही देख सकते हैं । इस लेख में हमने प्रत्येक राज्य की सूची बताने की कोशिश की है हाल ही में हुए घोषणा के तहत उज्ज्वला योजना के लाभार्थियों को कोरोना संकट के दौरान मुफ्त सिलिंडर दिए जाएंगे | इसकी जानकारी वित्त मंत्री ने 26 मार्च को की गई प्रेस कांफ्रेंस में की। इसी कांफ्रेंस में प्रधान मंत्री गरीब कल्याण योजना के तहत गरीबों को अन्न और धन मुहैया कराने की बात की गई।',
  'बीपीएल लिस्ट BPL List जैसे की आप सब जानते ही है की भारत एक कृषि प्रधान देश है। जिसमे भारत के नागरिकों के लिए राशन कार्ड होना अत्यंत आवश्यक है । आजकल राशन कार्ड का उपयोग बहुत सी योजनाओ में हो रहा है, और राशन कार्ड का होना भी बहुत जरूरी है। भारत में चाहे कोई भी कितना गरीब से गरीब व्यक्ति हो या अमीर व्यक्ति हो उसके पास राशन कार्ड होना जरुरी है। बीपीएल लिस्ट [BPL List] कैसे चेक करेंगे यहाँ आपको बता रहे हैं। भारत में राशन कार्ड के अलग-अलग प्रकार होते हैं। इनमे से एक बीपीएल कार्ड धारक के लोग आते हैं जो गरीब रेखा से नीचे आते हैं।',
  'पंचायत को उपलब्ध संसाधनों का उपयोग करते हुए आर्थिक विकास एवं सामाजिक न्याय के लिए ग्राम पंचायतों को ग्राम पंचायत विकास योजना (जीपीडीपी) तैयार करने हेतु अधिदेशित किया गया है। जीपीडीपी आयोजना प्रक्रिया व्यापक तथा भागीदारीपूर्ण प्रक्रिया पर आधारित होनी चाहिए जो संविधान की ग्यारहवीं अनुसूची में सूचीबद्ध 29 विषयों से संबंधित सभी केन्द्रीय मंत्रालयों/ संबद्ध विभागों की योजनाओं के साथ पूरे अभिसरण के साथ शामिल है। पंचायतों की ग्रामीण भारत के परिवर्तन में राष्ट्रीय महत्व के विषयों पर प्रमुख योजनाओं के प्रभावी और कुशल कार्यान्वयन में महत्वपूर्ण भूमिका है। वर्ष 2022-23 के लिए जीपीडीपी तैयार करने हेतु जन योजना अभियान (पीपुल्स प्लान कंपैन) 01 मई से 15 जून तक',
  'भारत सरकार के ग्रमीण विकास मंत्रालय के द्वारा वर्ष 2005 में राष्ट्रीय ग्रामीण रोजगार गारंटी अधिनियम एक्ट पारित किया गया था जिसे नरेगा के नाम से भी जाना जाता है। जिसके अनुसार देश के ग्रामीण क्षेत्रों में रहने वाले ऐसे परिवार जिनमे वयस्क सदस्य अकुशल शारीरिक कार्य करने के लिए अनुकूल हैं, उनको साल के 100 दिन का गारंटी के साथ मजदूरी कार्य को उपलब्ध करा के रोजगार देना है। अब नरेगा के तहत शहरी गरीबों को भी रोजगार दिया जायेगा। नरेगा जॉब लिस्ट देश के 34 राज्य और केंद्र शासित प्रदेशों के लिए जारी की गयी है। नेशनल रूरल एम्प्लॉयमेंट गारण्टी एक्ट (NREGA) जिसे महात्मा गाँधी नेशनल रूरल एम्प्लॉयमेंट गारण्टी एक्ट (MGNREGA) के नाम से भी जाना जाता है। प्रतिवर्ष ग्रामीण विकास मंत्रालय नरेगा जॉब कार्ड लिस्ट जारी करता है। इस वर्ष के लिए भारत सरकार ने नरेगा जॉब कार्ड लिस्ट जारी कर दी है। आप नरेगा की आधिकारिक वेबसाइट nrega.nic.in से मगरेगा जॉब कार्ड लिस्ट डाउनलोड कर सकते हैं। इसके साथ ही साथ हमने आपकी सुविधा के लिए अपने पेज पर राज्यानुसार मगरेगा लिस्ट प्राप्त करने की लिंक उपलब्ध करा दी है।',
  'दोस्तों, अगर आप उत्तरप्रदेश के रहने वाले हैं और प्रदेश सरकार की किसी भी पेंशन योजना से हाल ही में जुड़े हैं तो आप ऑनलाइन ही देख सकते हैं के आपका नाम प्रदेश सरकार की पेंशनर सूची में है या नहीं | इस ऑनलाइन सुविधा के माध्यम से सभी पेंशन भोगी यह वेरीफाई कर सकते हैं के वो पेंशन के लाभार्थी बने हुए है या फिर कहीं सूची से उनका नाम तो नहीं कट गया |',
  'भारत में केंद्र सरकार और राज्य सरकार मिलकर देश की गरीब असहाय नागरिकों के लिए कई प्रकार की पेंशन योजनाएं संचालित कर रही हैं। देश के गरीब और असहाय नागरिकों को आर्थिक सहायता प्रदान करने के लिए इन पेंशन योजनाओं का संचालन सरकार द्वारा किया जाता है। प्रमुख पेंशन योजनाओं में वृद्धावस्था पेंशन योजना, विधवा पेंशन योजना, विकलांग पेंशन योजना आदि हैं। इन पेंशन योजनाओं का लाभ प्राप्त करके गरीब नागरिक अपने जीवन को यापन करने के लिए आर्थिक सहायता प्राप्त करते हैं। जिससे उन्हें आर्थिक रुप से कुछ सहायता प्राप्त हो जाती है।',
];
List<String> link = [
  'https://pmaymis.gov.in/open/find_beneficiary_details.aspx',
  'https://pmaymis.gov.in/',
  'https://pmaymis.gov.in/open/find_beneficiary_details.aspx',
  'https://pmaymis.gov.in/open/find_beneficiary_details.aspx',
  'https://upbhulekh.gov.in/public/public_ror/Public_ROR.jsp',
  'https://fcs.up.gov.in/',
  'https://swachhbharatmission.gov.in/sbmcms/index.htm',
  'https://www.pmuy.gov.in/index.aspx',
  'https://nfsa.gov.in/portal/Ration_Card_State_Portals_AA',
  'https://gpdp.nic.in/progressgpdp.html?OWASP_CSRFTOKEN=0FFO-HCGK-1Q6S-4X6C-3YWB-OOJ0-1K4S-ALGV',
  'https://nrega.nic.in/',
  'https://pensionersportal.gov.in/',
  'https://socialsecurity.mp.gov.in/Public/Pages/List_of_Total_Pensioners.aspx',
];
