// ignore_for_file: non_constant_identifier_names, prefer_typing_uninitialized_variables

int index = 0;

class Proof {
  final Proof_Name,
      Proof_Description,
      proof_Hindi,
      iconName,
      iconName1,
      proof_link;

  Proof(this.Proof_Name, this.Proof_Description, this.proof_Hindi,
      this.iconName, this.iconName1, this.proof_link);
}

final List<Proof> ProofList = List.generate(
    Proof_Name.length,
    (index) => Proof(
          Proof_Name[index],
          Proof_Description[index],
          Proof_Hindi[index],
          iconName[index],
          iconName1[index],
          proof_link[index],
        ));

List<String> Proof_Name = [
  'PF Services',
  'Adhar Card',
  'Voter Card',
  'Pan Card',
  'Driving',
  'Ration Card',
];

List<String> Proof_Hindi = [
  "PF Services",
  "आधार कार्ड",
  "मतदान कार्ड",
  "पैन कार्ड",
  "ड्राइविंग लाइसेंस",
  "राशन कार्ड",
];

List Proof_Description = [
  "कर्मचारी भविष्य निधि (EPF) एक रिटायर्मेंट प्लान है जिसे कर्मचारी भविष्य निधि संगठन (EPFO) मैनेज करता है। ईपीएफ योजना में कर्मचारी और उसका नियोक्ता/ कंपनी हर महीने बराबर राशि का योगदान करते हैं जो मूल वेतन और महंगाई भत्ते का 12% होता है। कंपनी के योगदान का 8.33% हिस्सा कर्मचारी पेंशन योजना (EPS) के लिए जाता है।",
//=============================Adhar Card
  """आधार क भारत सरकार द्वारा भारत के नागरिकों को जारी किया जाने वाला पहचान पत्र है। इसमें 12 अंकों की एक विशिष्ट संख्या छपी होती है जिसे भारतीय विशिष्ट पहचान प्राधिकरण (भा.वि.प.प्रा.) जारी करता है।[3] यह संख्या, भारत में कहीं भी, व्यक्ति की पहचान और पते का प्रमाण होगा। भारतीय डाक द्वारा प्राप्त और यू.आई.डी.ए.आई. की वेबसाइट से डाउनलोड किया गया ई-आधार दोनों ही समान रूप से मान्य हैं। कोई भी व्यक्ति आधार के लिए नामांकन करवा सकता है बशर्ते वह भारत का निवासी हो और यू.आई.डी.ए.आई. द्वारा निर्धारित सत्यापन प्रक्रिया को पूरा करता हो, चाहे उसकी उम्र और लिंग (जेण्डर) कुछ भी हो। प्रत्येक व्यक्ति केवल एक बार नामांकन करवा सकता है। नामांकन निःशुल्क है। आधार कार्ड एक पहचान पत्र मात्र है तथा यह नागरिकता का प्रमाणपत्र नहीं है।
   आधार दुनिया की सबसे बड़ी बॉयोमीट्रिक आईडी प्रणाली है। विश्व बैंक के मुख्य अर्थशास्त्री पॉल रोमर ने आधार को \"दुनिया में सबसे परिष्कृत आईडी कार्यक्रम\" के रूप में वर्णित किया । निवास का सबूत माना जाता है और नागरिकता का सबूत नहीं है, आधार स्वयं भारत में निवास के लिए कोई अधिकार नहीं देता है। जून 2017 में गृह मंत्रालय ने स्पष्ट किया कि आधार नेपाल और भूटान यात्रा करने वाले भारतीयों के लिए वैध पहचान दस्तावेज नहीं है। तुलना के बावजूद, भारत की आधार परियोजना संयुक्त राज्य अमेरिका के सोशल सिक्योरिटी नंबर की तरह कुछ नहीं है क्योंकि इसमें अधिक उपयोग और कम सुरक्षा है।""",
//=========================Voter Card
  "भारत के वयस्क अधिवासियों के लिए भारत निर्वाचन आयोग द्वारा जारी एक पहचान दस्तावेज है, जो 18 वर्ष की आयु पूरा किये ब्यक्तियोको दिया जाता है, मुख्य रूप से भारतीय मतदाता पहचान पत्र [2] देश के नगरपालिका, राज्य और राष्ट्रीय चुनाव में अपना मत डालते समय भारतीय नागरिकों के लिए एक पहचान प्रमाण के रूप में कार्य करता है । यह अन्य उद्देश्यों जैसे मोबाइल फोन सिम कार्ड खरीदने या पासपोर्ट के लिए आवेदन करने के लिए सामान्य पहचान, पता और आयु प्रमाण के रूप में भी कार्य करता है । यह भूमि या वायु द्वारा नेपाल और भूटान की यात्रा करने के लिए एक यात्रा दस्तावेज के रूप में भी कार्य करता है । इसे चुनावी फोटो पहचान पत्र (EPIC)[3] के रूप में भी जाना जाता है । इसे मुख्य चुनाव आयुक्त टीएन शेषन (TN Seshan) के कार्यकाल के दौरान पहली बार 1993 में पेश किया गया था ।",
//=====================Pan Card
  """पैन कार्ड के लिए ऑनलाइन अप्लाई करने के बारे में यह जान लेना जरूरी है कि पैन कार्ड क्या है। पैन कार्ड एक अंग्रेजी शब्द है। इसे हम प्रापर रुप में PAN Card कहते हैं। PAN Card का फुल फॉर्म Permanent Account Number और हिन्दी में स्थाई खाता नंबर कहते हैं।

पैन कार्ड भारत सरकार के आयकर विभाग द्वारा बनता है। किसी व्यक्ति का उसके पुरे जीवन में केवल एक बार पैन कार्ड बन सकता है। अगर व्यक्ति का पैन कार्ड खो जाता है तो उसको दुबारा बनवाया जा सकता है। लेकिन कोई व्यक्ति यह चाहे कि उसको दो पैन कार्ड जारी कर दिए जाये तो यह संभव नही है।

पैन कार्ड केवल किसी इंसान का ही नही बनता बल्कि पैन कार्ड किसी कारोबार, बिजनेस, उद्योग, विभाग, सरकार, मंत्रालय, एकीकृत हिन्दू परिवार और किसी भी संस्था का भीबनता है।

सरकार की नजर में पैन कार्ड किसी भी व्यक्ति का आमदनी मांपने का जरिया है। टैक्स भरते समय जो महत्वपूर्ण कागज मांगा जाता है वह है पैन कार्ड । टैक्स भरने और फाइनेंशियल निवेश करने के लिए पैन कार्ड नंबर (Pan Card Number) अनिवार्य होता है।

पैन कार्ड नंबर कुल 10 अंकों का होता है जिसमे 6 अंगेजी के अक्षर होते हैं और 4 अंक होते हैं। पैन कार्ड नंबर में व्यक्ति का टैक्स और इन्वेस्ट सम्बंधित सभी डाटा होता है। पैन कार्ड के जरिये ही सिबिल क्रेडिट स्कोर चेक किया जाता है।
""",
//==============Driving
  """इविंग करने के लिए आपको ड्राइविंग लाइसेंस (Driving License) की जरूरत पड़ती है. कार और बाईक चलाने के लिए परमानेंट ड्राइविंग लाइसेंस जारी किया जाता है, जो देश का सबसे आम ड्राइविंग लाइसेंस है. भारत में कार, बाइक या दूसरी गाड़ी चलाने के लिए आरटीओ ड्राइविंग लाइसेंस जारी करता है. लाइसेंस हासिल करने के लिए आरटीओ (RTO) के नियमों से गुजरना पड़ता है और ड्राइविंग टेस्ट देना होता है. ड्राइविंग टेस्ट पास करने के बाद आरटीओ आपको ड्राइविंग लाइसेंस जारी करता है. देश में कई तरह के ड्राइविंग लाइसेंस जारी किए जाते हैं, जिनके बारे में हम आपको बता रहे हैं. यह आवेदक (Applicant ) पर निर्भर करता है कि उसे कौनसा लाइसेंस चाहिए.

लर्नर ड्राइविंग लाइसेंस

यदि आप पहली बार ड्राइविंग लाइसेंस बनवा रहे हैं, तो आपको सबसे पहले लर्नर ड्राइविंग लाइसेंस के लिए आवेदन करना होगा. यह लाइसेंस ड्राइविंग सीखने के लिए जारी किया जाता है. इसकी वैलिडिटी केवल छह महीने के लिए होती, जो सभी तरह के ड्राइविंग लाइसेंस में सबसे कम है. लर्नर ड्राइविंग लाइसेंस जारी होने के एक महीने बाद परमानेंट ड्राइविंग लाइसेंस के लिए आवेदन किया जा सकताहै.

परमानेंट ड्राइविंग लाइसेंस

यह सबसे ज्यादा बनने वाला ड्राइविंग लाइसेंस है. लर्नर ड्राइविंग लाइसेंस हासिल करने के बाद परमानेंट ड्राइविंग लाइसेंस के लिए आवेदन किया जा सकता है. इसलिए लर्नर ड्राइविंग लाइसेंस के एक्सपायर होने से पहले परमानेंट ड्राइविंग लाइसेंस के लिए आवेदन कर देना चाहिए. ड्राइविंग टेस्ट पास करने के बाद आरटीओ परमानेंट ड्राइविंग लाइसेंस जारी करता है.

कमर्शियल ड्राइविंग लाइसेंस

कमर्शियल वाहन चलाने के लिए यह ड्राइविंग लाइसेंस जारी किया जाता है. कमर्शियल ड्राइविंग लाइसेंस की तीन कैटेगरी होती है- हैवी मोटर व्हीकल, मीडियम मोटर व्हीकल और लाइट गूड्स ट्रांसपोर्ट मोटर व्हीकल. कमर्शियल ड्राइविंग लाइसेंस हासिल करने के लिए एलिजिबिलिटी थोड़ी अलग होती है. हालांकि, इसके लिए आवेदन करने की प्रक्रिया परमानेंट ड्राइविंग लाइसेंस के ही जैसी है.

""",
//============Ration Card
  "राशन कार्ड या राशन स्टांप एक कार्ड है जो किसी सरकार की ओर से जारी किया जाता है। यह कार्डधारक को भोजन या अन्य सामान प्राप्त करने की सुविधा प्रदान करता है जो युद्ध के दौरान कम मात्रा में उपल्ब्ध किए जा रहे हों या किसी अन्य आपात स्थितियों में जब राशन करने लागू की जाती चुकी हो। इसे युद्ध के अंत के बाद भी दोनों पक्षों की ओर से लागू कर रहे हैं जब मषार्बियन की मझेशतें धीरे-धीरे सामान्य पर पहुंचे हैं। राशन स्टांप किसी भी समय पर आवश्यक खाद्यान्न बनाए रखने के लिए भी ब रोए कार लाया जाता है। इसका कारण यह प्रयास है कि किसी भी व्यक्ति को दूसरे व्यक्ति से अधिक खाद्यान्न जमा करने का आधिकारिक रूप से मौका न मिले।",
];

List<String> iconName = [
  "स्थापना पंजीकरण",
  "आधार नामांकन",
  "मतदान लिस्ट में नाम देखे",
  "नए पैन के लिए आवेदन आवेदन",
  "नए लर्निंग लाइसेन्स के लिए आवेदन",
  "राशन कार्ड में पता बदले"
];

List<String> iconName1 = [
  'KYC अधीनीकरण',
  "आधार अपडेट",
  "नए मतदान के लिए आवेदन आवेदन",
  "पैन कार्ड सुधार ऑनलॉइन",
  "आवेदन की स्थिति चेक करे",
  "राशन कार्ड में नाम एड करे"
];

List proof_link = [
  "http://www.shramsuvidha.gov.in/home",
  "https://appointments.uidai.gov.in/easearch.aspx?AspxAutoDetectCookieSupport=1",
  "https://electoralsearch.in/",
  "https://www.onlineservices.nsdl.com/paam/endUserRegisterContact.html",
  "https://parivahan.gov.in/parivahan/",
  "https://nfsa.gov.in/portal/ration_card_state_portals_aa",
];
